fras/tm4c1294-hw-demo/Firmware/hw_demo.c
    return 0;
}



// SSI access.
int SsiAccess(char *pcCmd, char *pcParam)
{
    int i;
    uint8_t ui8SsiPort = 0;
    uint8_t ui8SsiRw = 0;   // 0 = write; 1 = read
    uint8_t ui8SsiDataNum = 0;
    uint32_t pui32SsiData[32];
    tSSI *psSsi;
    int32_t i32SsiStatus;
    // Parse parameters.
    for (i = 0; i < sizeof(pui32SsiData) / sizeof(pui32SsiData[0]); i++) {
        if (i != 0) pcParam = strtok(NULL, UI_STR_DELIMITER);
        if (i == 0) {
            if (pcParam == NULL) {
                UARTprintf("%s: SSI port number required after command `%s'.", UI_STR_ERROR, pcCmd);
                break;
            } else {
                ui8SsiPort = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 1) {
            if (pcParam == NULL) {
                UARTprintf("%s: SSI read/write required after command `%s'.", UI_STR_ERROR, pcCmd);
                break;
            } else {
                ui8SsiRw = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0x01;
            }
        } else {
            if (i == 2 && ui8SsiRw == 0 && pcParam == NULL) {
                UARTprintf("%s: At least one data byte required after SSI write command `%s'.", UI_STR_ERROR, pcCmd);
                return -1;
            }
            if (pcParam == NULL) break;
            else pui32SsiData[i-2] = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
        }
    }
    if (i < 2) return -1;
    // Check if the SSI port number is valid.
    switch (ui8SsiPort) {
        case 2: psSsi = &sSsi2; break;
        case 3: psSsi = &sSsi3; break;
        default:
            UARTprintf("%s: Only SSI port numbers 2 and 3 are supported!", UI_STR_ERROR);
            return -1;
    }
    // SSI write.
    if (ui8SsiRw == 0) {
        i32SsiStatus = SsiMasterWrite(psSsi, pui32SsiData, i - 2);
        // Check the SSI status.
        if (i32SsiStatus) {
            UARTprintf("%s: Error status from the SSI master %d: %d", UI_STR_ERROR, ui8SsiPort, i32SsiStatus);
        } else {
            UARTprintf("%s.", UI_STR_OK);
        }
    // SSI read.
    } else {
        if (i == 2) ui8SsiDataNum = 1;
        else ui8SsiDataNum = pui32SsiData[0];
        if (ui8SsiDataNum > sizeof(pui32SsiData) / sizeof(pui32SsiData[0])) {
            ui8SsiDataNum = sizeof(pui32SsiData) / sizeof(pui32SsiData[0]);
        }
        i32SsiStatus = SsiMasterRead(psSsi, pui32SsiData, ui8SsiDataNum);
        // Check the SSI status.
        if (i32SsiStatus != ui8SsiDataNum) {
            UARTprintf("%s: Could only read %d data bytes from the SSI master %d instead of %d.", UI_STR_ERROR, i32SsiStatus, ui8SsiPort, ui8SsiDataNum);
        } else {
            UARTprintf("%s.", UI_STR_OK);
        }
        if (i32SsiStatus > 0) {
            UARTprintf(" Data:");
            for (i = 0; i < i32SsiStatus; i++) UARTprintf(" 0x%02x", pui32SsiData[i]);
        }
    }
    
    return 0;
}



// UART access.
int UartAccess(char *pcCmd, char *pcParam)
{
    int i;
    uint8_t ui8UartPort = 0;
    uint8_t ui8UartRw = 0;  // 0 = write; 1 = read
    uint8_t ui8UartDataNum = 0;
    uint8_t pui8UartData[32];
    tUART *psUart;
    int32_t i32UartStatus;
    // Parse parameters.
    for (i = 0; i < sizeof(pui8UartData) / sizeof(pui8UartData[0]); i++) {
        if (i != 0) pcParam = strtok(NULL, UI_STR_DELIMITER);
        if (i == 0) {
            if (pcParam == NULL) {
                UARTprintf("%s: UART port number required after command `%s'.", UI_STR_ERROR, pcCmd);
                break;
            } else {
                ui8UartPort = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 1) {
            if (pcParam == NULL) {
                UARTprintf("%s: UART read/write required after command `%s'.", UI_STR_ERROR, pcCmd);
                break;
            } else {
                ui8UartRw = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0x01;
            }
        } else {
            if (i == 2 && ui8UartRw == 0 && pcParam == NULL) {
                UARTprintf("%s: At least one data byte required after UART write command `%s'.", UI_STR_ERROR, pcCmd);
                return -1;
            }
            if (pcParam == NULL) break;
            else pui8UartData[i-2] = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
        }
    }
    if (i < 2) return -1;
    // Check if the UART port number is valid.
    switch (ui8UartPort) {
        case 6: psUart = &sUartBoosterPack2; break;
        default:
            UARTprintf("%s: Only UART port number 6 is supported!", UI_STR_ERROR);
            return -1;
    }
    // UART write.
    if (ui8UartRw == 0) {
        i32UartStatus = UartWrite(psUart, pui8UartData, i - 2);
        // Check the UART status.
        if (i32UartStatus) {
            UARTprintf("%s: Error status from the UART %d: %d", UI_STR_ERROR, ui8UartPort, i32UartStatus);
        } else {
            UARTprintf("%s.", UI_STR_OK);
        }
    // UART read.
    } else {
        if (i == 2) ui8UartDataNum = 1;
        else ui8UartDataNum = pui8UartData[0];
        if (ui8UartDataNum > sizeof(pui8UartData) / sizeof(pui8UartData[0])) {
            ui8UartDataNum = sizeof(pui8UartData) / sizeof(pui8UartData[0]);
        }
        i32UartStatus = UartRead(psUart, pui8UartData, ui8UartDataNum);
        // Check the UART status.
        if (i32UartStatus != ui8UartDataNum) {
            UARTprintf("%s: Could only read %d data bytes from the UART %d instead of %d.", UI_STR_ERROR, i32UartStatus, ui8UartPort, ui8UartDataNum);
        } else {
            UARTprintf("%s.", UI_STR_OK);
        }
        if (i32UartStatus > 0) {
            UARTprintf(" Data:");
            for (i = 0; i < i32UartStatus; i++) UARTprintf(" 0x%02x", pui8UartData[i]);
        }
    }
    
    return 0;
}

